// ------------------------------------------------------------------------
// Main Window
// ------------------------------------------------------------------------
"Speed Dial/Group Dial List"="Pikavalinnan/ryhmävalinnan luettelo";
"Str_Fax_Printer_Speed_Dial_Speed_Dial_Count"="Pikavalinta: %d";
"Str_Fax_Printer_Speed_Dial_Group_Dial_Count"="Ryhmä: %d";
"Str_Fax_Printer_Speed_Dial_Speed_Dial_Max"="Syöttötietojen maksimimäärä: %d";
"Str_Fax_Printer_Speed_Dial_Group_Dial_Max"="Voit lisätä jopa %d pikavalinnan syöttötietoa.";
"Import from Other Phone Book"="Tuo muista Osoitekirja";

// ------------------------------------------------------------------------
// OK/Cancel
// ------------------------------------------------------------------------
"OK"="OK";
"Cancel"="Kumoa";

// ------------------------------------------------------------------------
// Confirm write Speed Dial/Group Dial for Printer
// ------------------------------------------------------------------------
"Str_Alert_Printer_Speed_Dial_Confirm_Write"="Pikavalinta/ryhmävalinta tulostimelle \"%@\" on vaihdettu.\nHaluatko tallentaa nämä muutokset tulostimeen?";
"Str_Alert_Printer_Speed_Dial_Confirm_Before_Execute"="Pikavalinta/ryhmävalinta tulostimelle \"%@\" on vaihdettu.";

// ------------------------------------------------------------------------
// Wait Dialog(read Speed Dial/Group Dial)
// ------------------------------------------------------------------------
"Str_Alert_Printer_Speed_Dial_Read_Wait_Dial"="Hanki pikavalinnat...";

// ------------------------------------------------------------------------
// Confirm write data
// ------------------------------------------------------------------------
"Str_Alert_Printer_Speed_Dial_Confirm_Write_Data"="Valmis tietojen tallennuksen aloitukseen. Haluatko jatkaa?";

// ------------------------------------------------------------------------
// Confirm over write data
// ------------------------------------------------------------------------
"Str_Alert_Printer_Speed_Dial_Confirm_ReWrite"="Kolmas osapuoli päällekirjoittaa tulostimen pikavalinnan/ryhmävalinnan asetukset.\nHaluatko päällekirjoittaa?";

// ------------------------------------------------------------------------
// Wait Dialog(write Speed Dial/Group Dial)
// ------------------------------------------------------------------------
"Str_Alert_Printer_Speed_Dial_Send_Wait_Dial"="Lähetä pikavalinnat...";

// ------------------------------------------------------------------------
// Confirm Import data
// ------------------------------------------------------------------------
"Str_Alert_Printer_Speed_Dial_Confirm_Import_Dial"="Jos tuodaan henkilökohtaisia tietoja, jotka sisältävät pikavalintanimille merkkejä, joita ei tueta, pikavalinnan sarake jätetään tyhjäksi.";

// ------------------------------------------------------------------------
// Select Import Target
// ------------------------------------------------------------------------
"Select Import Target"="Valitse tuontikohde";
"Select data to import."="Valitse tuotavat tiedot.";

// ------------------------------------------------------------------------
// Edit Speed Dial
// ------------------------------------------------------------------------
"Str_Edit_Speed_Dial_Dlg_Window_Title"="Muokkaa pikavalintaa";
"Str_Edit_Speed_Dial_Entry_Number"="Syöttönumero : %d";
"Name/Group Name"="Nimi/ryhmän nimi";
"Fax Number"="Faksinumero";
"Because \"-\" acts as a pause, do not use it to punctuate phone numbers."="Koska \"-\" toimii taukona, älä käytä sitä puhelinnumeroiden välimerkkinä.";
"Speed Dial"="Pikavalinta";
"Group Dial"="Ryhmävalinta";

// ------------------------------------------------------------------------
// Edit Group Dial
// ------------------------------------------------------------------------
"Str_Edit_Group_Dial_Dlg_Window_Title"="Muokkaa ryhmävalintaa";
"Str_Edit_Group_Dial_Entry_Number"="Syöttönumero : %d";
"Member"="Jäsen";
"Entry Number"="Syöttönumero";

// ------------------------------------------------------------------------
// Confirm Delete Data
// ------------------------------------------------------------------------
"Str_Alert_Printer_Speed_Dial_Confirm_Delete_Dial"="Haluatko poistaa syöttönro %d pikavalinnan?";
"Str_Alert_Printer_Speed_Dial_Confirm_Delete_Dial_Group"="Syöttönro %d pikavalinta kuuluu yhdelle tai useammalle ryhmälle ja se myös poistetaan ryhmästä(ryhmistä).\nHaluatko poistaa syöttönro %d pikavalinnan?";
"Str_Alert_Printer_Speed_Dial_Confirm_Delete_Dial_Group_Count0"="Syöttönro %d pikavalinta on rekisteröity yhdelle tai useammalle ryhmälle ja se myös poistetaan ryhmästä(ryhmistä). Tämän tuloksena jotkin ryhmistä tyhjenevät ja ne myös poistetaan.\nHaluatko poistaa syöttönro %d pikavalinnan?";
"Str_Alert_Printer_Speed_Dial_Confirm_Delete_Group"="Haluatko poistaa syöttönro %d ryhmävalinnan?";

// ------------------------------------------------------------------------
// Confirm Delete All Data
// ------------------------------------------------------------------------
"Str_Alert_Printer_Speed_Dial_Confirm_Delete_Dial_All"="Haluatko tyhjentää kaikki pikavalintaluettelot ja ryhmävalintaluettelot tulostimelle \"%@\"?";

// ------------------------------------------------------------------------
// Menu
// ------------------------------------------------------------------------
"FAX Utility"="FAX Utility";
"About FAX Utility..."="Tietoja FAX Utility...";
"Preferences..."="Asetukset...";
"Services"="Palvelut";
"Hide FAX Utility"="Kätke FAX Utility";
"Hide Others"="Kätke muut";
"Show All"="Näytä kaikki";
"Quit FAX Utility"="Poistu FAX Utility";
"File"="Tiedosto";
"Get Speed Dials..."="Hanki pikavalinnat...";
"Send Speed Dials..."="Lähetä pikavalinnat...";
"Import"="Tuo";
"Back up"="Varmuuskopio";
"Close"="Sulje";
"From Address Book"="Osoitekirja";
"Save Backup..."="Tallenna varmuuskopio...";
"Restore Backup..."="Palauta varmuuskopio...";
"Edit"="Muokkaa";
"Undo"="Kumoa";
"Redo"="Tee uudelleen";
"Cut"="Leikkaa";
"Copy"="Kopioi";
"Paste"="Liitä";
"Select All"="Valitse kaikki";
"Edit..."="Muokkaa...";
"Delete"="Poista";
"Delete All"="Poista kaikki";
"Window"="Ikkuna";
"Minimize"="Pienennä";
"Help"="Ohje";

// ------------------------------------------------------------------------
// Alert(Common)
// ------------------------------------------------------------------------
"Str_Alert_Common_Cancel"="Kumoa";
"Str_Alert_Common_OK"="OK";

"Str_Alert_Common_Necessary_File_Not_Found"="Tarvittavaa tiedostoa ei löydy sovelluksen suorittamiseen.\nAsenna FAX Utility uudelleen.";
"Str_Alert_Common_Cannot_Get_Printer_Information"="Tulostimen (faksin) tietoja ei voi saada. Mene kohtaan \"Tulostus- & faksivalinnat\" ja lisää PC-FAX-ohjain.";
"Str_Alert_Common_Confirm_OverWrite"="Määritetty tiedosto on jo olemassa. Halutko päällekirjoittaa?";
"Str_Alert_Common_Not_Responding_Error"="Tulostin ei vastaa. Varmista, että tulostin on kytketty oikein ja virta on päällä.";
"Str_Alert_Common_Communication_Error"="Tapahtui tulostimen yhteysvirhe.";
"Str_Alert_Common_Printer_Processing_Error"="Tulostin käsittelee tietoja. Odota hetki ja yritä sitten uudelleen.";
"Str_Alert_Common_Communication_Error_With_ErrorCode"="Havaittiin virhe kommunikoinnissa tulostimen kanssa.\nVirhekoodi (%d)";
"Str_Alert_Common_Error_Occurred"="Käsittely peruutettu, koska tapahtui virhe.";
"Str_Alert_Common_PrinterStatusError"="Tulostimessa tapahtui virhe. Tyhjennä virhe ja yritä sitten uudelleen.";

// ------------------------------------------------------------------------
// Alert(Printer Speed Dial/Group Dial)
// ------------------------------------------------------------------------
"Str_Alert_Fax_SpeedDial_GroupDial_Cannot_Open"="Pikavalinnan/ryhmävalinnan luetteloa ei voi avata, koska toinen FAX Utility -toiminto on jo käynnissä. Odota, kunnes se on päättynyt ja yritä uudelleen.";
"Str_Alert_Fax_SpeedDial_GroupDial_Dial_Data_Write_Failed"="Pikavalinnan/ryhmävalinnan kirjoitus epäonnistui.\nHaluatko poistua pikavalinnan/ryhmävalinnan luettelosta?";
"Str_Alert_Fax_SpeedDial_GroupDial_Cannot_Open_Fax_Phone_Book"="Osoitekirja ei voi avata.\nVirhekoodi (%d)";
"Str_Alert_Fax_SpeedDial_GroupDial_Fax_Phone_Book_Not_Found"="Osoitekirja ei löydy.\nTuonti peruutettu.";
"Str_Alert_Fax_SpeedDial_GroupDial_Cannot_Get_Fax_Phone_Book_Data"="Osoitekirja ei voi saada tietoja.";
"Str_Alert_Fax_SpeedDial_GroupDial_BackupFile_Write_Failed_Volume_Near_Full"="Varmuuskopiotiedoston kirjoitus epäonnistui.\nVapaata tilaa ei ole tarpeeksi tai se saattaa olla kirjoitussuojattu.";
"Str_Alert_Fax_SpeedDial_GroupDial_BackupFile_Write_Failed_Other_Application_Using"="Varmuuskopiotiedoston kirjoitus epäonnistui.\nToinen sovellus käyttää määritettyä tiedostoa.";
"Str_Alert_Fax_SpeedDial_GroupDial_BackupFile_Write_Failed_With_ErrorCode"="Varmuuskopiotiedoston kirjoitus epäonnistui.\nVirhekoodi (%d)";
"Str_Alert_Fax_SpeedDial_GroupDial_BackupFile_Read_Failed_File_Broken"="Tiedostomuotoa ei voi tunnistaa.\nTiedosto saattaa olla viallinen tai se on luotu toisella sovelluksella.";
"Str_Alert_Fax_SpeedDial_GroupDial_BackupFile_Read_Failed_Other_Application_Using"="Varmuuskopiotiedoston kirjoitus epäonnistui.\nToinen sovellus käyttää määritettyä tiedostoa.";
"Str_Alert_Fax_SpeedDial_GroupDial_BackupFile_Read_Failed_With_ErrorCode"="Varmuuskopiotiedoston luku epäonnistui.\nVirhekoodi (%d)";
"Str_Alert_Fax_SpeedDial_GroupDial_Input_GroupName_Not_Support"="Nimeen/ryhmän nimeen on syötetty merkki, jota ei tueta.\nVoit käyttää vain aakkosnumeerisia merkkejä ja symboleja.";
"Str_Alert_Fax_SpeedDial_GroupDial_Input_FaxNumber_Not_Support"="Faksinumerossa on merkki(merkkejä), jota(joita) ei tueta.\nSallittuja merkkejä ovat vain 0-9, *, #, - ja välilyönti.";
"Str_Alert_Fax_SpeedDial_GroupDial_Confirm_Delete_Speed_Dial"="Syöttönro %d pikavalinta on rekisteröity yhdelle tai useammalle ryhmälle. Pikavalinnan vaihtaminen ryhmävalintaan poistaa pikavalinnan nykyisestä(nykyisistä) ryhmästä(ryhmistä).\nHaluatko muuttaa syöttönron %d pikavalinnan ryhmävalintaan?";
"Str_Alert_Fax_SpeedDial_GroupDial_Confirm_Delete_Speed_Dial_And_Group_Dial"="Syöttönro %d pikavalinta on rekisteröity yhdelle tai useammalle ryhmälle. Pikavalinnan vaihtaminen ryhmävalintaan poistaa pikavalinnan nykyisestä(nykyisistä) ryhmästä(ryhmistä).Tämän tuloksena jotkin ryhmistä tyhjenevät ja ne myös poistetaan.\nHaluatko muuttaa syöttönron %d pikavalinnan ryhmävalintaan?";
"Str_Alert_Fax_SpeedDial_GroupDial_Maximum_Group_Dial"="Voit rekisteröidä jopa %d pikavalintanumeroa yhteen ryhmään.";
"Str_Alert_Fax_SpeedDial_GroupDial_Input_Name_Is_Space_Only"="Nimeen/ryhmän nimeen ei voi syöttää vain välilyöntejä.";
"Str_Alert_Fax_SpeedDial_GroupDial_Input_FaxNumber_Is_Space_Only"="Faksinumeroon ei voi syöttää vain välilyöntejä.";
"Str_Alert_Fax_SpeedDial_GroupDial_Import_File_Not_Found"="Tuotavaa tiedosto ei löydy.";
"Str_Alert_Fax_SpeedDial_GroupDial_BackupFile_Read_Failed_File_Version"="Valittua tiedostoa ei voi lukea, koska se oli luotu FAX Utility -apuohjelman uudemmalla versiolla.";
"Str_Alert_Fax_SpeedDial_GroupDial_BackupFile_Read_Confirm_Trim_Data"="Määritetyssä tiedostossa on joitakin syöttötietoja, joita ei voi palautaa, koska niiden syöttönumerot ylittävät alla näytetyn kytketyn tulostimen raja-arvon.\nHaluatko palauttaa kelvolliset syöttötiedot?";
"Str_AlertInfo_Fax_SpeedDial_GroupDial_BackupFile_Read_Confirm_Trim_Data"="Syöttötietojen maksimimäärä: %d\nSyöttötietojen maksimimäärä ryhmävalintaa kohden: %d";
"Str_Alert_Fax_SpeedDial_GroupDial_BackupFile_Read_NoAvailableData"="Määritetystä tiedostosta ei voi palauttaa mitään syöttötietoja.";

// ------------------------------------------------------------------------
"NickName"="Hakemistosana";
"Fax Speed"="Faksin nopeus";
"Default Speed"="Oletus";
"StrAlert_Input_NickName_UnknownCharacter_Not_Support"="Hakemistosanaan on syötetty merkki, jota ei tueta.";
"StrAlert_Input_Name_UnknownCharacter_Not_Support"="Nimeen/ryhmän nimeen on syötetty merkki, jota ei tueta.";
"Str_InUseByAnotherFunction"="Käytössä toisessa toiminnossa";

"StrAlert_InUseByAnotherFunction_CannotMove"="Ei voi siirtää. Toinen toiminto käyttää parhaillaan yhtä tai useampaa syöttötietoa määritetyssä paikassa tai sen lähettyvillä.";
"StrAlert_ProtectedData_Exist"="Yhtä tai useampaa syöttötietoa käytetään ajoitetulle faksille tai muille toiminnoille. Ne on suojattu eikä niitä voi muuttaa.";
"StrAlert_ProtectedData_CannotMove"="Ei voi siirtää. Yhtä tai useampaa syöttötietoa suojataan määritetyssä paikassa tai sen lähettyvillä.";
"StrAlert_PhoneBook_ReWrite"="Muu käyttäjä on muuttanut yhtä tai useampaa syöttötietoa.\nHaluatko korvata?";
"StrAlert_ProtectedData_WriteExcept"="Seuraavista syöttötiedoista tulee suojattuja, koska toinen käyttäjä on alkanut käyttää niitä.\nSyöttönumero: %@\n\nHaluatko kirjoittaa syöttötiedot lukuun ottamatta yllä olevia?";
"StrAlert_InUseByAnotherFunction_ClearData"="\"Käytössä toisessa toiminnossa\"-viestissä näkyviä syötteitä ei voi tallentaa.\nHaluatko jatkaa?";
"StrAlert_ProtectedData_CannotSaveStatus"="Joidenkin syöttötietojen suojattua tilaa ei tallenneta.\nHaluatko jatkaa?";
"StrAlert_RestoreData_ClearNameUnknownCharacter"="Nimi/ryhmän nimi -kenttä on tyhjä, jos palautettujen tietojen kentässä on merkkejä, joita ei tueta.";
"StrAlert_InUseByAnotherFunction_RestoreData"="Toinen toiminto käyttää yhtä tai useampaa syöttötietoa. Ne myös korvataan palautetuilla syöttötiedoilla.\nHaluatko jatkaa?";

"StrAlert_ProtectedData_1"="Seuraavia syöttöarvoja ei voi tallentaa tulostimeen. Niitä on käytetty ja ne on suojattu sen jälkeen, kun sait ne tulostimesta. Tallennettaessa syöttöarvot korvataan tulostimessa olevilla syöttöarvoilla, ja kaikki niihin tehdyt muutokset menetetään.\nSyöttönumero: %@";
"StrAlert_ProtectedData_2"="Seuraaviin ryhmävalintojen syöttöarvoihin sisältyy yksi tai useampia pikavalintoja, jotka ovat tällä hetkellä suojattuja tulostimessa. Näitä pikavalintoja ei sisällytetä, kun tallennetaan ryhmä. Ryhmävalinnat poistetaan, kun ryhmässä ei ole pikavalintaa.\nSyöttönumero: %@";
"StrAlert_ProtectedData_3"="Haluatko jatkaa?";
"StrAlert_RestoreData_1"="Seuraavia pikavalintoja tai ryhmävalintoja ei voi palauttaa varmuuskopiotiedostoon.\nSyöttönumero: %@\nYllä mainittujen numeroiden suojattuja syöttöarvoja ei voi korvata.";
"StrAlert_RestoreData_2"="Seuraaviin ryhmävalintojen syöttöarvoihin sisältyy yksi tai useampia pikavalintoja, joita ei voi palauttaa. Mitään ei-palautettavia pikavalintoja ei sisällytetä, kun palautetaan ryhmä. Ryhmävalinnat poistetaan, kun ryhmässä ei ole pikavalintaa.\nSyöttönumero: %@";
"StrAlert_RestoreData_3"="Haluatko jatkaa?";
"StrAlert_Confirm_Delete_ALLData_ExceptProtect"="On olemassa yksi tai useampia pikavalintojen tai ryhmävalintojen syöttöarvoa. Mitään suojattuja syöttöarvoja ei voi poistaa.\nHaluatko poistaa kaikki syöttöarvot paitsi suojatut arvot?";

"Str_FaxContacts"="Yhteystiedot";
"Str_FaxAddressBook"="Osoitekirja";
"StrAlert_CannotAccessContacts_A"="Vaihtoehdon %@ käyttöä ei ole sallittu.";
"StrAlert_CannotAccessContacts_B"="Salli FAX Utility -apuohjelman käyttää vaihtoehtoa %@. Siirry kohtaan [Järjestelmäasetukset] - [Suojaus ja yksityisyys] - [Yksityisyys] - [%@].\nKäynnistä FAX Utility -apuohjelma suorittaaksesi päivityksen.";
